//=============================================================================
//
// スパークパーティクル処理 [particle_spark.h]
// Author : GP11A132 09 倉田勇次
//
//=============================================================================
#pragma once

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	PARTICLE_SPARK_MAX	(1024)
#define	PARTICLE_SPARK_SPD	(1.0f)

#define	PARTICLE_SPARK_LIFE	(60)

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT   InitParticleEffect(void);
void    UninitParticleEffect(void);
void    UpdateParticleEffect(void);
void      DrawParticleEffect(void);

int SetParticleEffect(XMFLOAT3 pos, XMFLOAT3 move, int life, BOOL origin);
void ResetParticleSpark(int idx);

XMFLOAT3 CalcParticleSparkMove(XMFLOAT3 hitPos);
