//=============================================================================
//
// BG処理 [bg.h]
// Author : GP11A132 09 倉田勇次
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct BG
{
	XMFLOAT3	old_pos;	// １フレ前のポリゴンの座標
	XMFLOAT3	pos;		// ポリゴンの座標
	float		w, h;		// 幅と高さ
	float		scrl;		// スクロール
	float		scrl2;		// スクロール
	int			texNo;		// 使用しているテクスチャ番号
	BOOL		pose;		// poseメニュー
};


#define	SKY_H	(150.0f)	// 空のポリゴンの高さ


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBG(void);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

BG* GetBG(void);



