//=============================================================================
//
// スコア処理 [score.h]
// Author : GP11A132 09 倉田勇次
//
//=============================================================================
#pragma once
#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define LEVEL_MAX	(99999)		// レベルの上限
#define LEVEL_DIGIT	(3)			// 桁数

//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct LEVEL
{

	// 経験値関係
	float guage;
	float guagemax;
	int   level;

};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLevel(void);
void UninitLevel(void);
void UpdateLevel(void);
void DrawLevel(void);
LEVEL* GetLevel(void);


// 経験値集め
void GuagePlus(float num);



