//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : GP11A132 09 倉田勇次
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAPCHIP_MAX			(2)								// マップチップの種類
#define MAP_TEXTURE_WIDTH	(32)							// マップチップのテクスチャーの幅
#define MAP_TEXTURE_HEIGHT	(32)							// マップチップのテクスチャーの高さ 
#define FIELD_HEIGHT		(640.0f)						// マップの座標のマックス g_Mapも増やすこと // 2048	(736.0f)	
#define FIELD_WIDTH			(1760.0f)						// マップの座標のマックス					// 2048	(1984.0f)	


//*****************************************************************************
// 構造体定義
//*****************************************************************************

struct MAPCHIP
{
	int			texNo;			// テクスチャ番号

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMap(void);
void UninitMap(void);
void UpdateMap(void);
void DrawMap(void);

// X座標のスクロール幅の取得する
float GetScrollX(void);

float GetScrollY(void);

// マップのデータをとってくる
int GetMapDate(int y, int x);





