//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : GP11A132 09 倉田勇次
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum
{
	TITLE_GAMESTART,
	TITLE_EXPLANATION,
	TITLE_EXIT,
	TITLE_MAX,
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


